[
    {
        "hikeTitle": "Old Rag",
        "datePosted": "Feb 5 2018",
        "author": "Sam Gehret",
        "authorID": "testID",
        "drivingDistance": "2-3 hours",
        "hikeDuration": "7 hours, 9 miles",
        "hikeDifficulty": 8,
        "hikeSummary": "Old Rag Mountain is a 3,284 feet (1,001 m) mountain near Sperryville in Madison County, Virginia. A part of the Blue Ridge Mountains, the peak is located within Shenandoah National Park and is the most popular hiking destination within the park",
        "hikeDetail": "There are several ways to hike Old Rag, but the most popular is a circuit that takes you up the Ridge Trail, across the rock scramble to the summit, than down the Saddle Trail to the Weakley Hollow Fire Road and back to where you began. The first 2 miles will be an increasingly steeper climb along a beautiful wooded trail. You are likely to see deer and other wildlife, as well as a steady profusion of wildflowers during the spring, summer, and fall. Watch for changes in vegetation as you gain altitude. About 2 miles into the hike you will come out of the woods onto the ridgetop. Here's where the fun begins. For the next mile and a half you will climb, slide, shimmy, and crawl your way across and around giant granite boulders. Follow the blue blazes to stay on track. If you see a double blaze, that means the trail will take a sharp turn or switchback. As you make your way to the summit you can pause at several fabulous viewpoints, but don't stop there-eventually you will make it to an unmatched 360 degree view. As you navigate the boulders notice the geology of Old Rag. You'll see quartz and feldspar and a great example of columnar jointing that forms a natural staircase. Notice, too the change in vegetation. From the summit, you can look across much of the nearly 200,000 protected acres of Shenandoah National Park, a portion of which is federally designated wilderness. Take time to appreciate this relatively unspoiled example of forest and mountain. You are about 4 miles from your starting point. Some hikers return via the rock scramble, but most prefer to continue on the Saddle Trail. Especially on busy weekends, attempting the rock scramble in reverse feels a lot like swimming upstream! As you travel down the Saddle Trail you will encounter two shelters, first Byrd's Nest, and then the Old Rag Shelter. Both are day-use only. There is an outdoor privy at the Old Rag Shelter (a little over a mile from the summit). If nature calls please use it instead of the outdoors. If you cannot make it to the privy, be sure to use Leave No Trace principles (cathole method).",
        "hikeComments": [
            {
                "commentText": "Comment 1",
                "commentor": "Sam G",
                "dateComment": "March 1 2018"
            },
            {
                "commentText": "Comment 2",
                "commentor": "Tom G",
                "dateComment": "March 2 2018"
            }
        ]
        
    },
    {
        "hikeTitle": "Billy Goat Trail",
        "datePosted": "Feb 7 2018",
        "author": "Sam Gehret",
        "authorID": "testID",
        "drivingDistance": "15 minutes",
        "hikeDuration": "1-3 hours, 2-5 miles",
        "hikeDifficulty": 2,
        "hikeSummary": "The Billy Goat Trail is a 4.7-mile (7.6 km) hiking trail that follows a path between the C&O Canal and the Potomac River within the Chesapeake and Ohio Canal National Historical Park near Great Falls in Montgomery County, Maryland. The trail has three sections: Section A, the northernmost, is 1.7 miles (2.7 km); Section B is 1.4 miles (2.3 km); and Section C, the southernmost, is 1.6 miles (2.6 km)",
        "hikeDetail": "Billy Goat Trail was laid out by the YMCA Triangle Club in 1919.[1] Section A of the trail, by far the most popular, is on Bear Island and traverses rough and rocky terrain, including a steep climb along a cliff face along the Potomac River's Mather Gorge. At another point in the trail, hikers are required to scramble over and around huge boulders. Sections B and C are less strenuous; section B requires only one brief scramble, and section C has none. Most of the trail is well marked with light blue trail blazes. Section A is best accessed from the Great Falls Tavern Visitor Center. Section B and Section C are best accessed from Carderock, Maryland. All sections of the trail are free, although an entrance fee ($10 per car - 2015) is charged when entering and parking near the Great Falls Tavern Visitor Center. No fee is charged when parking near Carderock. Dogs are not allowed on Section A, nor on Olmsted Island (Great Falls Overlook), but are permitted on a leash at all times everywhere else in the park. It takes about 2 1/2 hours to do the Section A loop from the parking lot. The three sections of the trail do not connect directly with each other, but are connected to each other by the towpath along the C&O Canal. The end point of section C is about 2.75 miles (4.4 km) southeast along the towpath from the starting point of section A."
    },
    {
        "hikeTitle": "Sugarloaf Mountain",
        "datePosted": "March 7 2018",
        "author": "Sam Gehret",
        "authorID": "testID",
        "drivingDistance": "1.5 hours",
        "hikeDuration": "2-5 hours",
        "hikeDifficulty": 5,
        "hikeSummary": "Sugarloaf Mountain is the prominence visible in the piedmont as it rises out of the plains southeast of Frederick MD. The mountain and trails are maintained by Stronghold, Inc. a non-profit setup by Louise and Gordon Strong in 1946 to preserve the mountain so it could be enjoyed by everyone. The mountain has many wonderful hiking trails that can be combined to create many different loops. The hike we have here is a 6.8 mile variation of the blue Northern Peak Trail loop.",
        "hikeDetail": "From the East View parking area, start the hike up the orange blazed trail as it steeply ascends the mountain for 0.3 miles and ends at the red blazed trail (if you don't want to make the hike up the steep orange blazed trail, park a the West View parking area and take the green trail to the summit, where it turns in to the red trail). At the red trail intersection at the end of the orange trail turn left for 100 yards to the summit of Sugarloaf Mountain, and views to the south. Return down the red trail, passing the orange trail you ascended, for 0.3 miles where it ends at the intersection of the blue Northern Peak Trail and McCormack Overlook. From this point turn right and follow the blue trail. The blue trail will meet the white blazed trail in 0.1 mile where it turns left and becomes the blue/white trail. In 0.1 miles the white trail turns left, and the blue right. Turn right continuing to follow the blue blazed trail. The Stronghold, Inc. trail map is also marked with location signage. The marker on the blue trail will be 'B2', use these to help navigate the loop. The next intersection will be with the yellow and purple trails. Remain on the blue trail towards White Rocks. 1.2 miles from this intersection arrive at White Rocks. There are 2 overlooks here. Continue on the blue blazed loop as it descends the mountain and turns left on a mountain road in another 0.8 miles, then makes a quick right, and turns off the road to the left back into the forest. The blue trail will now climb for 0.9 miles to the junction of the white loop trail. Turn right on the blue/white trail for 0.4 mile at which point the white trail splits off to the right. Remain straight uphill for another 150 yards to the West View parking area. From this point hike down the road for 150 yards and at the hairpin turn remain straight on the one-way section. Follow the road the remaining 0.3 miles to the hike start point and East View parking area."
    },
    {
        "hikeTitle": "Harper's Ferry",
        "datePosted": "March 7 2018",
        "author": "Sam Gehret",
        "authorID": "testID",
        "drivingDistance": "1.5 hours",
        "hikeDuration": "2-6 hours",
        "hikeDifficulty": 6,
        "hikeSummary": "Harpers Ferry NHP has about 20 miles of hiking trails. The trails vary from easy, riverside strolls to four-mile hikes across Civil War battlefields to eight-mile adventures to the tops of mountains. Pan the perfect hike: location, length and intensity (easy, moderate, difficult); highlights (views, wildlife, historical significance); hiking time (based on one mile hiked per 30 minutes).",
        "hikeDetail": "Difficult (steep and rocky in places), 4.5 or 6.5 miles round trip, 3 to 4 hours. Wayside exhibits. The Maryland Heights Trail offers hikers the opportunity to see many aspects of Harpers Ferry NHP on one walk: spectacular scenery, geology, Civil War and transportation history. From the Information Center in Lower Town turn right to merge with the Appalachian Trail at the dead end of Shenandoah Street. Cross the footbridge over the Potomac River. Turn left (upstream) on the C&O Canal Towpath. The trail stays on the towpath for 0.3 miles, and then crosses a footbridge over the canal bed to Harpers Ferry Road. Be careful! Watch for traffic. Directly across the road is the Maryland Heights trailhead. The first bend on this green-blazed trail offers a nice view of the Potomac. Go straight at the first intersection to a see the 1862 Naval Battery, then return to the green-blazed trail and turn right. At the next two intersections stay straight on the red-blazed Overlook Cliff Trail. About 0.3 miles turn right for a narrow, rocky descent 0.5 miles to the cliffs overlooking Harpers Ferry. Backtrack to the first intersection with the blue-blazed Stone Fort Trail. Hike one mile uphill past Civil War artillery batteries and through boulders to the Civil War Stone Fort. The trail curves out of the Stone Fort past breastworks and descends steeply over one mile back to the green-blazed trail. Turn right and backtrack to the C&O Canal Towpath."
    }

]